Конфигурация/Catalogs/Оповещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Оповещения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТекста</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТекстовЭлектронныхПисем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПисьмоВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартинкиПисьмаВФорматеHTML</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьСписокПолучателейИзИсточника</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСравнений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ВсеТипы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокЗначений</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Источники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяИсточника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Catalogs/Оповещения/Ext/ManagerModule.bsl
Функция ПолучитьОповещения(ПолноеИмяИсточника, ТипСобытия, РеквизитыОповещения) Экспорт
	
	Оповещения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Оповещения.Ссылка КАК Ссылка,
		|	Оповещения.Параметры.(
		|		Имя КАК Имя,
		|		ВидСравнения КАК ВидСравнения,
		|		Значение КАК Значение,
		|		СписокЗначений КАК СписокЗначений
		|	) КАК Параметры,
		|	Оповещения.Тема КАК Тема,
		|	Оповещения.Текст КАК Текст,
		|	Оповещения.Получатели КАК Получатели,
		|	Оповещения.ПисьмоВФорматеHTML КАК ПисьмоВФорматеHTML,
		|	Оповещения.ТекстПисьмаВФорматеHTML КАК ТекстПисьмаВФорматеHTML,
		|	Оповещения.ДополнятьСписокПолучателейИзИсточника КАК ДополнятьСписокПолучателейИзИсточника,
		|	ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, """") КАК АдресОтправителя
		|ИЗ
		|	Справочник.Оповещения КАК Оповещения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО Оповещения.Ссылка = ЗначенияДополнительныхСведений.Объект
		|			И (ЗначенияДополнительныхСведений.Свойство.Ключ = ""АдресОтправителя"")
		|ГДЕ
		|	Оповещения.ТипСобытия = &ТипСобытия
		|	И НЕ Оповещения.ПометкаУдаления
		|	И Оповещения.Ссылка В
		|			(ВЫБРАТЬ
		|				ОповещенияИсточники.Ссылка
		|			ИЗ
		|				Справочник.Оповещения.Источники КАК ОповещенияИсточники
		|			ГДЕ
		|				ОповещенияИсточники.ПолноеИмяИсточника = &ПолноеИмяИсточника)";

	Запрос.УстановитьПараметр("ТипСобытия"			, ТипСобытия);
	Запрос.УстановитьПараметр("ПолноеИмяИсточника"	, ПолноеИмяИсточника);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Оповестить = Истина;
		
		ПараметрыСобытия = Выборка.Параметры.Выбрать();
		Пока ПараметрыСобытия.Следующий() Цикл
			Если ПараметрыСобытия.Имя = "КлючевыеРеквизиты" Тогда
				Если НЕ ИзменилсяОдинИзКлючевыхРеквизитов(РеквизитыОповещения, ПараметрыСобытия.ВидСравнения, ПараметрыСобытия.Значение, ПараметрыСобытия.СписокЗначений) Тогда
					Оповестить = Ложь;
					Прервать;
				КонецЕсли;
				
			ИначеЕсли Не РеквизитыОповещения.Свойство(ПараметрыСобытия.Имя) 
				Или Не СравнитьЗначениеСПараметром(РеквизитыОповещения[ПараметрыСобытия.Имя], ПараметрыСобытия.ВидСравнения, ПараметрыСобытия.Значение, ПараметрыСобытия.СписокЗначений) Тогда 
				
				Оповестить = Ложь;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;

		Если Оповестить Тогда
			Тема	= Выборка.Тема;
			Текст	= ?(Выборка.ПисьмоВФорматеHTML, Выборка.ТекстПисьмаВФорматеHTML, Выборка.Текст);
			
			Для Каждого Реквизит Из РеквизитыОповещения Цикл
				Тема	= СтрЗаменить(Тема	, "[" + Реквизит.Ключ + "]", Реквизит.Значение);
				Текст	= СтрЗаменить(Текст	, "[" + Реквизит.Ключ + "]", Реквизит.Значение);
			КонецЦикла;
			
			Картинки = Новый Структура;
			Если Выборка.ПисьмоВФорматеHTML Тогда
				Картинки = Выборка.Ссылка.КартинкиПисьмаВФорматеHTML.Получить();
			КонецЕсли;
			Если Картинки <> Неопределено И Картинки.Количество() > 0 Тогда
				ФорматированныйДокумент = Новый ФорматированныйДокумент;
				ФорматированныйДокумент.УстановитьHTML(Текст, Картинки);
				Текст = ФорматированныйДокумент;
			КонецЕсли;
			
			МассивПолучателей = Новый Массив;
			
			Если ЗначениеЗаполнено(Выборка.Получатели) Тогда
				МассивПолучателей.Добавить(Выборка.Получатели);
			КонецЕсли;
			
			Если Выборка.ДополнятьСписокПолучателейИзИсточника И РеквизитыОповещения.Свойство("ДополнительныеПолучатели") И ЗначениеЗаполнено(РеквизитыОповещения.ДополнительныеПолучатели) Тогда
				МассивПолучателей.Добавить(РеквизитыОповещения.ДополнительныеПолучатели);
			КонецЕсли;
			
			Если МассивПолучателей.Количество() = 0 Тогда
				ВызватьИсключение 
					СтрШаблон("Для оповещения %1 не указан ни один получатель.
						|Тема: %2
						|Текст: %3", Выборка.Ссылка, Тема, Текст);
			КонецЕсли;	
				
			Оповещение = Новый Структура();
			Оповещение.Вставить("Получатели", СтрСоединить(МассивПолучателей, ";"));
			Оповещение.Вставить("Тема"		, Тема);
			Оповещение.Вставить("Текст"		, Текст);
			Оповещение.Вставить("ТипТекста"	, ?(Выборка.ПисьмоВФорматеHTML, "HTML", "ПростойТекст"));
			
			Если ЗначениеЗаполнено(Выборка.АдресОтправителя) Тогда
				
				МассивАдресов = РаботаСоСтрокамиКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Выборка.АдресОтправителя);

				Если МассивАдресов.Количество() = 1 Тогда
					
					СтруктураАдреса = МассивАдресов[0];
					
					РеквизитыОтправителя = Новый Структура("ИмяПользователя, АдресЭлектроннойПочты", СтруктураАдреса.Представление, СтруктураАдреса.Адрес);
					РеквизитыОповещения.Вставить("РеквизитыОтправителя", РеквизитыОтправителя);
					
				КонецЕсли;
				
			КонецЕсли; 
			
			Оповещения.Добавить(Оповещение);
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Оповещения;
	
КонецФункции

Функция СформироватьОповещения(ПолноеИмяИсточника, ТипСобытия, РеквизитыОповещения) Экспорт
	
	Перем Организация;
	
	РеквизитыОповещения.Свойство("Организация", Организация);
	
	Оповещения = ПолучитьОповещения(ПолноеИмяИсточника, ТипСобытия, РеквизитыОповещения);
	
	Для каждого Оповещение Из Оповещения Цикл
		ПараметрыПисьма = Новый Структура;
		ПараметрыПисьма.Вставить("Кому", 		Оповещение.Получатели);
		ПараметрыПисьма.Вставить("Тема", 		Оповещение.Тема);
		ПараметрыПисьма.Вставить("Тело", 		Оповещение.Текст);
		ПараметрыПисьма.Вставить("ТипТекста",	Оповещение.ТипТекста);
		
		Если РеквизитыОповещения.Свойство("РеквизитыОтправителя") Тогда
			ПараметрыПисьма.Вставить("РеквизитыОтправителя", РеквизитыОповещения.РеквизитыОтправителя);
			ПараметрыПисьма.Вставить("СлепыеКопии", РеквизитыОповещения.РеквизитыОтправителя.АдресЭлектроннойПочты);
		КонецЕсли; 
		
		Если РеквизитыОповещения.Свойство("Вложения") И РеквизитыОповещения.Вложения <> Неопределено Тогда
			ПараметрыПисьма.Вставить("Вложения", РеквизитыОповещения.Вложения);
		КонецЕсли; 
		
		РаботаСЭлектроннойПочтой.ОтправитьЭлектронноеПисьмо(
			РаботаСЭлектроннойПочтой.ПолучитьСистемнуюУчетнуюЗапись(),
			ПараметрыПисьма,
			,
			Истина,
			Организация
		);
	КонецЦикла;
	
КонецФункции // ЗарегистрироватьОповещенияДляОтложеннойОтправки

////////////////////////////////////////////////////////////////////////////////

Функция СравнитьЗначениеСПараметром(Значение, ВидСравнения, Параметр, ХранилищеЗначений)
	
	Если ВидСравнения = Перечисления.ВидыСравнений.Больше Тогда
		Возврат Значение > Параметр;
		
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнений.БольшеРавно Тогда
		Возврат Значение >= Параметр;
		
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнений.ВСписке Тогда
		Возврат ХранилищеЗначений.Получить().Найти(Значение) <> Неопределено;
		
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнений.Меньше Тогда
		Возврат Значение < Параметр;
		
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнений.МеньшеРавно Тогда
		Возврат Значение <= Параметр;
		
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнений.НеВСписке Тогда
		Возврат ХранилищеЗначений.Получить().Найти(Значение) = Неопределено;
		
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнений.НеРавно Тогда
		Возврат Значение <> Параметр;
		
	ИначеЕсли ВидСравнения = Перечисления.ВидыСравнений.Равно Тогда
		Возврат Значение = Параметр;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ИзменилсяОдинИзКлючевыхРеквизитов(РеквизитыОповещения, ВидСравнения, Параметр, ХранилищеЗначений)
	
	Результат = Ложь;
	ИзмененныеРеквизиты = Новый Массив;
	Если НЕ РеквизитыОповещения.Свойство("ИзмененныеРеквизиты", ИзмененныеРеквизиты) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ВидСравнения = Перечисления.ВидыСравнений.ВСписке Тогда
		СписокКлючевыхРеквизитов = ХранилищеЗначений.Получить();
	Иначе
		СписокКлючевыхРеквизитов = Новый Массив;
		СписокКлючевыхРеквизитов.Добавить(Параметр);
	КонецЕсли;
	
	ОписаниеИзмененияКлючевыхРеквизитов = Новый Массив;
	
	Для Каждого КлючевойРеквизит Из СписокКлючевыхРеквизитов Цикл
		Для Каждого ИзмененныйРеквизит Из ИзмененныеРеквизиты Цикл
			Если КлючевойРеквизит = ИзмененныйРеквизит.Ключ Тогда
				ОписаниеИзмененияКлючевыхРеквизитов.Добавить(
					СтрШаблон("%1: %2 [было: %3]",
						ИзмененныйРеквизит.Ключ,
						ИзмененныйРеквизит.Значение,
						ИзмененныйРеквизит.ПредЗначение));
				Результат = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	РеквизитыОповещения.Вставить("ОписаниеИзмененияКлючевыхРеквизитов", СтрСоединить(ОписаниеИзмененияКлючевыхРеквизитов, Символы.ПС));
	
	Возврат Результат;
	
КонецФункции
